app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)
    @article.user = current_user
    if @article.save
---
INSERT INTO "articles" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "article to be deleted"], ["description", "deleted description\r\n"], ["created_at", "2021-02-12 20:18:45.233287"], ["updated_at", "2021-02-12 20:18:45.233287"], ["user_id", 8]]